# 개,문자열 에러시 원화표시 추가, '' , '' 교차활용 

print("|\_/|")
print("|q p|   /}")
print('( 0 )"""\\')  # \'앞에 \을 붙여준다.
print('|"^"`    |')
print("||_/=\\\__|")  # \\ 앞에 \을 하나 더 붙여준다.

'''
|\_/|
|q p|   /}
( 0 )"""\
|"^"`    |
||_/=\\__|
'''


# 고양이

# print('\\    /\\')
# print(" )  ( ')")
# print("(  /  )")
# print(" \(__)|")

'''

\    /\
 )  ( ')
(  /  )
 \(__)|

문제
아래 예제와 같이 고양이를 출력하시오.

입력
없음.

출력
고양이를 출력한다.
'''


# 꼬마정인

# n,m,k = map(int,input().split())
# print(n+m+k)


'''
77 77 7777

7931

문제
꼬마 정민이는 이제 A + B 정도는 쉽게 계산할 수 있다. 이제 A + B + C를 계산할 차례이다!

입력
첫 번째 줄에 A, B, C (1 ≤ A, B, C ≤ 1012)이 공백을 사이에 두고 주어진다.

출력
A+B+C의 값을 출력한다.
'''


# 곱셈

# n = int(input())
# x,y,z = map(int,input())

# print(n*z)
# print(n*y)
# print(n*x)
# print(n*z*1 + n*y*10 + n*x*100)

'''
472
385

2360
3776
1416
181720

문제
(세 자리 수) × (세 자리 수)는 다음과 같은 과정을 통하여 이루어진다.
(1)과 (2)위치에 들어갈 세 자리 자연수가 주어질 때 (3), (4), (5), (6)위치에 들어갈 값을 구하는 프로그램을 작성하시오.

입력
첫째 줄에 (1)의 위치에 들어갈 세 자리 자연수가, 둘째 줄에 (2)의 위치에 들어갈 세자리 자연수가 주어진다.

출력
첫째 줄부터 넷째 줄까지 차례대로 (3), (4), (5), (6)에 들어갈 값을 출력한다.
'''

# 나머지

# n,m,k = map(int,input().split())
# print((n+m)%k)
# print(((n%k)+(m%k))%k)
# print((n*m)%k)
# print(((n%k)*(m%k))%k)


'''
5 8 4

1
1
0
0

문제
(A+B)%C는 ((A%C) + (B%C))%C 와 같을까?

(A×B)%C는 ((A%C) × (B%C))%C 와 같을까?

세 수 A, B, C가 주어졌을 때, 위의 네 가지 값을 구하는 프로그램을 작성하시오.

입력
첫째 줄에 A, B, C가 순서대로 주어진다. (2 ≤ A, B, C ≤ 10000)

출력
첫째 줄에 (A+B)%C, 둘째 줄에 ((A%C) + (B%C))%C, 셋째 줄에 (A×B)%C, 넷째 줄에 ((A%C) × (B%C))%C를 출력한다.
'''
# 1998년생인 내가 태국에서는 2541년생?!

# n = int(input())
# print(n-(2541-1998))

'''
2541

1998

문제
ICPC Bangkok Regional에 참가하기 위해 수완나품 국제공항에 막 도착한 팀 레드시프트 일행은 눈을 믿을 수 없었다. 
공항의 대형 스크린에 올해가 2562년이라고 적혀 있던 것이었다.

불교 국가인 태국은 불멸기원(佛滅紀元), 즉 석가모니가 열반한 해를 기준으로 연도를 세는 불기를 사용한다. 반면, 
우리나라는 서기 연도를 사용하고 있다. 불기 연도가 주어질 때 이를 서기 연도로 바꿔 주는 프로그램을 작성하시오.

입력
서기 연도를 알아보고 싶은 불기 연도 y가 주어진다. (1000 ≤ y ≤ 3000)

출력
불기 연도를 서기 연도로 변환한 결과를 출력한다.
'''


# ??!

# n = input()
# print(n+'??!')


'''
joonas

joonas??!

첫째 줄에 준하의 놀람을 출력한다. 놀람은 아이디 뒤에 ??!를 붙여서 나타낸다.

'''

# 사칙연산

# n,m = map(int,input().split())
# print((n+m))
# print((n-m))
# print((n*m))
# print((n//m))
# print((n%m))

'''
7 3

10
4
21
2
1
'''